# Ваша задача - расшифровать сообщение используя азбуку Морзе .
# В шифровке будет использован 1 пробел между буквами одого слова и 3 пробела между отдельными словами.
# Если расшифрованный текст начинается со слова, первая буква этого слова должна быть заглавной.

morse = {
    ".-": "a",
    "-...": "b",
    "-.-.": "c",
    "-..": "d",
    ".": "e",
    "..-.": "f",
    "--.": "g",
    "....": "h",
    "..": "i",
    ".---": "j",
    "-.-": "k",
    ".-..": "l",
    "--": "m",
    "-.": "n",
    "---": "o",
    ".--.": "p",
    "--.-": "q",
    ".-.": "r",
    "...": "s",
    "-": "t",
    "..-": "u",
    "...-": "v",
    ".--": "w",
    "-..-": "x",
    "-.--": "y",
    "--..": "z",
    "-----": "0",
    ".----": "1",
    "..---": "2",
    "...--": "3",
    "....-": "4",
    ".....": "5",
    "-....": "6",
    "--...": "7",
    "---..": "8",
    "----.": "9",
}


def morse_decoder(code):
    code = code.split('   ')
    tmp0 = []

    for words in code:
        tmp = ''
        for i in words:
            if i != ' ':
                tmp += i
            else:
                tmp += '1'
        tmp0.insert(0, tmp.split('1'))

    tmp0 = tmp0[::-1]
    res = ''

    for words in tmp0:
        for char in words:
            res += morse[char]
        res += ' '

    return res.capitalize()[:len(res) - 1]



if __name__ == "__main__":
    print("Example:")
    print(morse_decoder("... --- ..."))
    print(morse_decoder("... --- -- .   - . -..- -"))# == "Some text"
    print(morse_decoder("..--- ----- .---- ---.."))# == "2018"
    print(morse_decoder(".. -   .-- .- ...   .-   --. --- --- -..   -.. .- -.--"))#== "It was a good day"